# Tarea Python 02: Uso de Pandas para manejo de datos tabulares

[Facultad de Ingeniería](https://www.ingenieria.unam.mx/), [Universidad Nacional Autónoma de México](https://www.unam.mx/)

Profesor: **Saúl Arciniega Esparza** | [Twitter](https://twitter.com/zaul_arciniega) | [LinkedIn](https://www.linkedin.com/in/saularciniegaesparza/) | [ResearchGate](https://www.researchgate.net/profile/Saul-Arciniega-Esparza)

___
### Instrucciones

- Para los siguientes ejercicios contestar lo que se les pide. 

- En algunos casos, será necesario que **sustituyan XXX por su respuesta!**

- Se deberá entregar esta notebook con las respuestas, cambiando el nombre de la notebook a **Tarea_Python_02_Nombre_Apellido.ipynb**

- **Nota**: Se deben auxiliar con las notebooks de Python para ciencia de datos.

## Ejercicio 1

Leer los archivos de la carpeta Datos:

- Leer el archivo "serie_tiempo_01.csv" como una Serie:

In [2]:
#Importar la libreria de pandas

import pandas as pd

In [4]:
serie1 = pd.read_csv(
    './Datos/serie_tiempo_01.csv',
    sep=',',
    index_col=[0],
    header=None,
)
serie1 = serie1.squeeze()  # cargar como serie

serie1.head()

0
1981    1711.427306
1982    1351.959284
1983    1383.632541
1984    1667.587628
1985    1243.902077
Name: 1, dtype: float64

- Leer el archivo "serie_tiempo_02.csv" como una Serie:

In [6]:
serie2 = pd.read_csv(
    './Datos/serie_tiempo_02.csv',
    sep=',',
    index_col=[0],
)

serie2 = serie2.squeeze()  # cargar como serie

serie2.head()

Year
2000    1046.135338
2001    1087.709763
2002    1115.498482
2003    1089.348885
2004    1116.256393
Name: Variable1, dtype: float64

- Leer el archivo "serie_tiempo_03.csv" como un DataFrame:

In [7]:
df1 = pd.read_csv('./Datos/serie_tiempo_03.csv', index_col=[0], parse_dates=[0])
df1.head()

              1    2         3
Date
1981-01-01  0.0  0.0  0.091549
1981-01-02  0.0  0.0  0.000000
1981-01-03  0.0  0.0  0.000000
1981-01-04  0.0  0.0  0.000000
1981-01-05  0.0  0.0  0.000000

## Ejercicio 2

Consulta y reemplaza los datos tal y como se pide a continuación:

- De la serie 1, utiliza **.loc** para consultar el registro del año 2000:

In [9]:
print(serie1.loc[2000]) #llamar al elemento del anio 2000

1428.070041634084

- De la serie 2, utiliza **.iloc** para consultar el registro del año 2005:

In [10]:
print(serie2.iloc[5])

1074.2526321408

- De la serie 2, utiliza **.loc** para reeemplazar el registro del año 2005 por el valor 1000:

In [13]:
serie1.loc[2005] = 1000
print(serie1.loc[2005])

1000.0

- Del DataFrame, utiliza **.loc** para consultar el registro del "2000-01-01" al "2000-01-31" para todas las columnas:

In [15]:
df1.loc["2000-01-01":"2000-01-31", :]

              1    2    3
Date
2000-01-01  0.0  0.0  0.0
2000-01-02  0.0  0.0  0.0
2000-01-03  0.0  0.0  0.0
2000-01-04  0.0  0.0  0.0
2000-01-05  0.0  0.0  0.0
2000-01-06  0.0  0.0  0.0
2000-01-07  0.0  0.0  0.0
2000-01-08  0.0  0.0  0.0
2000-01-09  0.0  0.0  0.0
2000-01-10  0.0  0.0  0.0
2000-01-11  0.0  0.0  0.0
2000-01-12  0.0  0.0  0.0
2000-01-13  0.0  0.0  0.0
2000-01-14  0.0  0.0  0.0
2000-01-15  0.0  0.0  0.0
2000-01-16  0.0  0.0  0.0
2000-01-17  0.0  0.0  0.0
2000-01-18  0.0  0.0  0.0
2000-01-19  0.0  0.0  0.0
2000-01-20  0.0  0.0  0.0
2000-01-21  0.0  0.0  0.0
2000-01-22  0.0  0.0  0.0
2000-01-23  0.0  0.0  0.0
2000-01-24  0.0  0.0  0.0
2000-01-25  0.0  0.0  0.0
2000-01-26  0.0  0.0  0.0
2000-01-27  0.0  0.0  0.0
2000-01-28  0.0  0.0  0.0
2000-01-29  0.0  0.0  0.0
2000-01-30  0.0  0.0  0.0
2000-01-31  0.0  0.0  0.0

- Del DataFrame, utiliza **.loc** para consultar el registro del "2000-01-01" al "2000-01-05" sólo para la columna con el nombre "2":

In [16]:
df1.loc["2000-01-01":"2000-01-5", "2"]

Date
2000-01-01    0.0
2000-01-02    0.0
2000-01-03    0.0
2000-01-04    0.0
2000-01-05    0.0
Name: 2, dtype: float64

## Ejercicio 3

Realiza las operaciones algebráicas tal y como se pide a continuación:

- A partir de las series **serie1** y **serie2** realiza la siguiente operación

$$serie3 = 10 * \frac{serie1 - serie2}{serie2}$$

In [17]:
serie3 = 10 * (serie1 - serie2) / (serie2)
serie3.head()

1981   NaN
1982   NaN
1983   NaN
1984   NaN
1985   NaN
dtype: float64

- Remueve los NaNs de la **serie3**

In [18]:
serie3 = serie3.dropna()

serie3.head()

2000    3.650911
2001    1.229292
2002   -0.315753
2003    0.946637
2004   -0.165578
dtype: float64

- Utiliza el DataFrame **df1** y **.iloc** para realizar la suma de la primera más la segunda columna:

In [19]:
df1.iloc[:, 0] + df1.iloc[:, 1]

Date
1981-01-01    0.000000
1981-01-02    0.000000
1981-01-03    0.000000
1981-01-04    0.000000
1981-01-05    0.000000
                ...
2017-12-27    0.000000
2017-12-28    0.000000
2017-12-29    0.000000
2017-12-30    0.000000
2017-12-31    1.456496
Length: 13514, dtype: float64

## Ejercicio 4

Utiliza la función **pd.concat** para unir la **serie1** y **serie2** en un DataFrame de dos columnas:

In [34]:
df2 = pd.concat((serie1, serie2), axis=1)
df2.head()

                1  Variable1
1981  1711.427306        NaN
1982  1351.959284        NaN
1983  1383.632541        NaN
1984  1667.587628        NaN
1985  1243.902077        NaN

En el nuevo DataFrame, crea una nueva columna que se llame "Indice" que sea igual a la división de la primer columna entre la segunda columna (aquí puedes utilizar **.loc** o **.iloc**).

In [33]:
df2["Indice"] = df2.iloc[:, 0] / df2.iloc[:, 1]
df2.head()

                P           ET    Indice
2000  1428.070042  1046.135338  1.365091
2001  1221.421091  1087.709763  1.122929
2002  1080.276262  1115.498482  0.968425
2003  1192.470633  1089.348885  1.094664
2004  1097.773662  1116.256393  0.983442

Utiliza el comando adecuado para borrar todos los renglones sin datos en el DataFrame **df2**

In [32]:
df2 = df2.dropna()
df2.head()

                P           ET    Indice
2000  1428.070042  1046.135338  1.365091
2001  1221.421091  1087.709763  1.122929
2002  1080.276262  1115.498482  0.968425
2003  1192.470633  1089.348885  1.094664
2004  1097.773662  1116.256393  0.983442

Cambia el nombre de las columnas del DataFrame **df2** por "P", "ET" y "Indice":

In [31]:
df2.columns = ["P", "ET", "Indice"]
df2.head()

                P           ET    Indice
2000  1428.070042  1046.135338  1.365091
2001  1221.421091  1087.709763  1.122929
2002  1080.276262  1115.498482  0.968425
2003  1192.470633  1089.348885  1.094664
2004  1097.773662  1116.256393  0.983442